In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('nyc_weather.csv') 
df.head()

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,NaN,281
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,NaN,275
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,NaN,277
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,NaN,345
4,1/5/2016,20,-3,41,30.57,10,5.0,0,0,NaN,333

In [6]:
# get max temprature
df['Temperature'].max()

50

In [11]:
# dates when it rained

df.loc[df['Events']=='Rain', ['EST']]

          EST
8    1/9/2016
9   1/10/2016
15  1/16/2016
26  1/27/2016

In [15]:
# average windspeed
df['WindSpeedMPH'].mean()

6.892857142857143

In [16]:
df.shape

(31, 11)

In [17]:
df.head(3)

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,NaN,281
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,NaN,275
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,NaN,277

In [18]:
df[2:5]

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,NaN,277
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,NaN,345
4,1/5/2016,20,-3,41,30.57,10,5.0,0,0,NaN,333

In [19]:
df.columns

Index(['EST', 'Temperature', 'DewPoint', 'Humidity', 'Sea Level PressureIn',
       'VisibilityMiles', 'WindSpeedMPH', 'PrecipitationIn', 'CloudCover',
       'Events', 'WindDirDegrees'],
      dtype='object')

In [20]:
df.index

RangeIndex(start=0, stop=31, step=1)

In [22]:
df['EST'].head()

0    1/1/2016
1    1/2/2016
2    1/3/2016
3    1/4/2016
4    1/5/2016
Name: EST, dtype: object

In [24]:
df[['EST', 'Temperature']].head()

        EST  Temperature
0  1/1/2016           38
1  1/2/2016           36
2  1/3/2016           40
3  1/4/2016           25
4  1/5/2016           20

In [25]:
df['Temperature'].describe()

count    31.000000
mean     34.677419
std       7.639315
min      20.000000
25%      29.000000
50%      35.000000
75%      39.500000
max      50.000000
Name: Temperature, dtype: float64

In [28]:
df[df['Temperature'] == df['Temperature'].max()]

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
9,1/10/2016,50,46,71,29.59,4,NaN,1.8,7,Rain,109

In [30]:
pd.read_excel('weather_data.xlsx')

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [31]:
df.to_csv('df_new_csv.csv', index=False)

In [33]:
df.to_excel('df_new_excel.xlsx', sheet_name='weather_data')

In [34]:
df = pd.read_csv('weather_data_cities.csv')

In [35]:
df.head()

        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
4  1/1/2017    mumbai           90          5  Sunny

In [36]:
df.dtypes

day            object
city           object
temperature     int64
windspeed       int64
event          object
dtype: object

In [37]:
df['city'].value_counts()

paris       4
new york    4
mumbai      4
Name: city, dtype: int64

In [38]:
g = df.groupby('city')
g

In [45]:
# for each city, display its group
for city, city_df in g:
    print(city)
    print(city_df)

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [52]:
#using get_group
for city in df['city'].unique():
    print(city)
    print(g.get_group(city))

new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [49]:
# get specific group
g.get_group('new york')

        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny

In [53]:
# max  in each city
g.max()

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [56]:
g.mean()

          temperature  windspeed
city
mumbai          88.50       9.25
new york        32.25       8.00
paris           47.75      12.75

In [57]:
g.get_group('mumbai').mean()

temperature    88.50
windspeed       9.25
dtype: float64

<h3> Concatenate DataFrames </h3>

In [58]:
India_weather = pd.DataFrame({
'city':['mumbai', 'delhi', 'bangalore'],
'temperature': [32,45,30],
'humidity':[80,60,78]
})
India_weather

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78

In [59]:
US_weather = pd.DataFrame({
'city':['new york', 'chicago', 'orlando'],
'temperature': [21,14,28],
'humidity':[68,65,75]
})
US_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           28        75

In [62]:
weather_data = pd.concat([India_weather, US_weather], ignore_index=True)
weather_data

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78
3   new york           21        68
4    chicago           14        65
5    orlando           28        75

In [64]:
pd.concat([India_weather, US_weather], axis=1)

        city  temperature  humidity      city  temperature  humidity
0     mumbai           32        80  new york           21        68
1      delhi           45        60   chicago           14        65
2  bangalore           30        78   orlando           28        75

In [78]:
# merging of dataframes

temp_df = pd.DataFrame({
'city':['mumbai', 'delhi', 'bangalore','hyderabad'],
'temperature':[32,35,40,30 ]
})

temp_df

        city  temperature
0     mumbai           32
1      delhi           35
2  bangalore           40
3  hyderabad           30

In [83]:
humidity_df = pd.DataFrame({
'city':['mumbai', 'delhi', 'bangalore', 'Ã§hennai' ],
'humidity':[68, 65, 75, 70]
})

humidity_df

        city  humidity
0     mumbai        68
1      delhi        65
2  bangalore        75
3    Ã§hennai        70

In [84]:
pd.merge(temp_df,humidity_df, on='city')

        city  temperature  humidity
0     mumbai           32        68
1      delhi           35        65
2  bangalore           40        75

In [86]:
data = pd.merge(temp_df, humidity_df, on='city', how='outer')
data

        city  temperature  humidity
0     mumbai         32.0      68.0
1      delhi         35.0      65.0
2  bangalore         40.0      75.0
3  hyderabad         30.0       NaN
4    Ã§hennai          NaN      70.0

<h3>Indexing</h3>
<ul>
<li>loc</li>
<li>iloc</li>
</ul>

In [88]:
data.loc[0:3]

        city  temperature  humidity
0     mumbai         32.0      68.0
1      delhi         35.0      65.0
2  bangalore         40.0      75.0
3  hyderabad         30.0       NaN

In [89]:
data.iloc[0:3]

        city  temperature  humidity
0     mumbai         32.0      68.0
1      delhi         35.0      65.0
2  bangalore         40.0      75.0

In [96]:
data.loc[3]

city           hyderabad
temperature           30
humidity             NaN
Name: 3, dtype: object

In [97]:
data.loc[[3,1]]

        city  temperature  humidity
3  hyderabad         30.0       NaN
1      delhi         35.0      65.0

In [98]:
data.iloc[[3,1]]

        city  temperature  humidity
3  hyderabad         30.0       NaN
1      delhi         35.0      65.0